<template>
  <div>
    <common-back :currPage='currPage'>
    </common-back>
    <table id="table" ref="table"></table>


    <!--    <div class="inner-container">-->
    <!--      <p class="text" v-for="(text, index) in arr" :key="index">{{text}}</p>-->
    <!--    </div>-->
<!--    <vue-seamless-scroll :data="arr" class="seamless-warp" :class-option="classOption">-->
<!--      <ul>-->
<!--        <li v-for="item in arr" :key="item">-->
<!--          <span class="left-border">{{item['title']}} {{item['工单类型']}}</span>-->
<!--        </li>-->
<!--      </ul>-->
<!--    </vue-seamless-scroll>-->

    <vue-seamless-scroll :data="arr" class="seamless-warp" :class-option="classOption">
      <van-row style="text-align: center;font-size: small;"
               v-for="item in arr" :key="item['id']">
        <van-col span="4">{{item['level']}}</van-col>
        <van-col span="7">{{item['title']}}</van-col>
        <van-col span="4">{{item['问题类型']}}</van-col>
        <van-col span="5">{{item['当前处理人']}}</van-col>
        <van-col span="4">{{item['工单状态']}}</van-col>
      </van-row>
    </vue-seamless-scroll>

    <van-dropdown-menu>
      <van-dropdown-item v-model="value" :options="option" />
      <van-dropdown-item title="筛选" ref="item">
        <van-switch-cell v-model="switch1" title="包邮" />
        <van-switch-cell v-model="switch2" title="团购" />
        <van-button block type="info" @click="onConfirm">确认</van-button>
      </van-dropdown-item>
    </van-dropdown-menu>



  </div>
</template>

<script>
  import vueSeamlessScroll from 'vue-seamless-scroll'

  export default {
    name: "bootStrapTable",
    data() {
      return {
        value: 0,
        switch1: false,
        switch2: false,
        option: [
          { text: '全部商品', value: 0 },
          { text: '新款商品', value: 1 },
          { text: '活动商品', value: 2 },
        ],
        arr: [{
          "id": 121,
          "title": "这是主题",
          "level": "紧急",
          "当前处理人": "魏雷鸣",
          "处理时间": "2020-06-05T16:23:16",
          "工单状态": "工程师处理中",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 120,
          "title": "yjr测试工单",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-06-05T16:20:19",
          "工单状态": "等待工程师处理",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 119,
          "title": "测试PC端关注人映射",
          "level": "普通",
          "当前处理人": "魏雷鸣",
          "处理时间": "2020-06-04T14:58:38",
          "工单状态": "等待反馈",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 118,
          "title": "测试应用名称映射关系",
          "level": "普通",
          "当前处理人": "黄益敏",
          "处理时间": "2020-06-04T14:52:15",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 117,
          "title": "测试1",
          "level": "普通",
          "当前处理人": "黄益敏",
          "处理时间": "2020-06-04T14:42:04",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 116,
          "title": "测试",
          "level": "普通",
          "当前处理人": "黄益敏",
          "处理时间": "2020-06-04T14:03:46",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 115,
          "title": "测试测试",
          "level": "普通",
          "当前处理人": "刘艳波",
          "处理时间": "2020-06-04T11:07:32",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 114,
          "title": "测试附件",
          "level": "普通",
          "当前处理人": "龙飞",
          "处理时间": "2020-06-04T10:36:55",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 113,
          "title": "测试报障工单等级覆盖问题",
          "level": "紧急",
          "当前处理人": "魏雷鸣",
          "处理时间": "2020-06-04T10:21:11",
          "工单状态": "等待反馈",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 112,
          "title": "测试工单等级覆盖问题",
          "level": "普通",
          "当前处理人": "龙飞",
          "处理时间": "2020-06-04T10:16:57",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 111,
          "title": "主题测试文件",
          "level": "普通",
          "当前处理人": "魏雷鸣",
          "处理时间": "2020-06-04T16:10:31",
          "工单状态": "等待反馈",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 109,
          "title": "测试",
          "level": "普通",
          "当前处理人": "龙飞",
          "处理时间": "2020-06-02T17:08:42",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 108,
          "title": "测试技术审批",
          "level": "普通",
          "当前处理人": "黄益敏",
          "处理时间": "2020-06-02T16:15:27",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 107,
          "title": "测试",
          "level": "普通",
          "当前处理人": "刘艳波",
          "处理时间": "2020-06-02T15:55:13",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 103,
          "title": "测试流程",
          "level": "紧急",
          "当前处理人": "用户不存在",
          "处理时间": "2020-06-02T15:10:34",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 102,
          "title": "测试回退",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-06-02T15:05:08",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 101,
          "title": "测试小结",
          "level": "普通",
          "当前处理人": "刘艳波",
          "处理时间": "2020-06-02T15:19:54",
          "工单状态": "等待提交",
          "问题类型": "经纬CMS",
          "工单类型": "账号申请"
        }, {
          "id": 100,
          "title": "测试主题IP",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-02T14:07:04",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 99,
          "title": "测试1",
          "level": "紧急",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-06-02T14:09:11",
          "工单状态": "等待归档",
          "问题类型": "终端异常",
          "工单类型": "报障"
        }, {
          "id": 98,
          "title": "测试部门",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-02T13:55:40",
          "工单状态": "等待反馈",
          "问题类型": "经纬CMS",
          "工单类型": "账号申请"
        }, {
          "id": 97,
          "title": "test12345",
          "level": "紧急",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-06-02T13:24:40",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 96,
          "title": "部门权限测试",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-06-02T12:12:24",
          "工单状态": "部门经理审批",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 95,
          "title": "部门测试",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-06-02T11:44:32",
          "工单状态": "部门经理审批",
          "问题类型": "经纬CMS",
          "工单类型": "账号申请"
        }, {
          "id": 94,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:29:07",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 93,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:27:45",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 92,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:27:29",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 91,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:27:10",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 90,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:26:55",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 89,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:26:39",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 88,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:26:24",
          "工单状态": "等待工程师处理",
          "问题类型": "终端不可用",
          "工单类型": "报障"
        }, {
          "id": 87,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:26:09",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 86,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:25:50",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 85,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:25:30",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 84,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:25:14",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 83,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:24:56",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 82,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:24:39",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 81,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:24:15",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 80,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:23:53",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 79,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:23:32",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 78,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:22:51",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 77,
          "title": "1",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T11:22:21",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 76,
          "title": "测试小结",
          "level": "普通",
          "当前处理人": "刘艳波",
          "处理时间": "2020-06-02T10:51:13",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 75,
          "title": "测试1",
          "level": "普通",
          "当前处理人": "刘艳波",
          "处理时间": "2020-06-02T10:45:31",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 74,
          "title": "各项非空测试",
          "level": "紧急",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-06-02T14:25:30",
          "工单状态": "等待归档",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 73,
          "title": "Y",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-02T13:53:28",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 72,
          "title": "测试",
          "level": "普通",
          "当前处理人": "刘艳波",
          "处理时间": "2020-06-02T10:42:12",
          "工单状态": "等待评分",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 71,
          "title": "测试工单",
          "level": "普通",
          "当前处理人": "牟耀定",
          "处理时间": "2020-06-02T09:45:12",
          "工单状态": "部门经理审批",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 70,
          "title": "主题测试",
          "level": "紧急",
          "当前处理人": "牟耀定",
          "处理时间": "2020-06-02T09:41:51",
          "工单状态": "等待工程师处理",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 69,
          "title": "测试普通网络安全策略关联组织架构审批",
          "level": "普通",
          "当前处理人": "牟耀定",
          "处理时间": "2020-06-01T18:25:11",
          "工单状态": "部门经理审批",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 68,
          "title": "测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-01T17:49:18",
          "工单状态": "等待工程师处理",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 67,
          "title": "测试主题",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-02T09:38:23",
          "工单状态": "工程师处理中",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 65,
          "title": "普通账号申请",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-01T14:43:15",
          "工单状态": "副总经理审批",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 64,
          "title": "普通账号申请",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-01T14:37:22",
          "工单状态": "副总经理审批",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 63,
          "title": "测试紧急账号申请",
          "level": "紧急",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-06-03T11:40:34",
          "工单状态": "等待反馈",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 62,
          "title": "测试主管审批",
          "level": "普通",
          "当前处理人": "沈立",
          "处理时间": "2020-06-01T14:29:10",
          "工单状态": "副总经理审批",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 61,
          "title": "测试007",
          "level": "普通",
          "当前处理人": "牟耀定",
          "处理时间": "2020-06-01T12:52:49",
          "工单状态": "部门经理审批",
          "问题类型": "删除",
          "工单类型": "网络安全策略"
        }, {
          "id": 60,
          "title": "测试007",
          "level": "普通",
          "当前处理人": "牟耀定",
          "处理时间": "2020-06-01T12:52:32",
          "工单状态": "部门经理审批",
          "问题类型": "删除",
          "工单类型": "网络安全策略"
        }, {
          "id": 59,
          "title": "紧急账号申请",
          "level": "紧急",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-31T16:28:47",
          "工单状态": "部门经理审批",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 55,
          "title": "测试提交按钮实效",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-06-02T14:34:30",
          "工单状态": "等待归档",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 54,
          "title": "29测试4",
          "level": "紧急",
          "当前处理人": "常凯隆",
          "处理时间": "2020-05-29T11:12:54",
          "工单状态": "工程师处理中",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 52,
          "title": "29测试小结",
          "level": "紧急",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-29T10:53:23",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 47,
          "title": "29测试2",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-29T09:53:24",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 46,
          "title": "29测试1",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-29T09:30:07",
          "工单状态": "工程师处理中",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 44,
          "title": "测试4",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-28T17:02:27",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 43,
          "title": "测试3",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-28T14:58:27",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 42,
          "title": "测试2",
          "level": "紧急",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-28T14:59:23",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 39,
          "title": "测试",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-28T11:15:59",
          "工单状态": "工程师处理中",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 38,
          "title": "测试123",
          "level": "紧急",
          "当前处理人": "沈立",
          "处理时间": "2020-06-01T18:02:36",
          "工单状态": "派单",
          "问题类型": "删除",
          "工单类型": "网络安全策略"
        }, {
          "id": 37,
          "title": "测试",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-28T12:20:24",
          "工单状态": "等待归档",
          "问题类型": "其他",
          "工单类型": "报障"
        }, {
          "id": 35,
          "title": "测试",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-28T10:07:40",
          "工单状态": "技术经理审核",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 34,
          "title": "新员工WCMS账号申请",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-27T20:09:15",
          "工单状态": "等待归档",
          "问题类型": "WCMS",
          "工单类型": "账号申请"
        }, {
          "id": 33,
          "title": "测试2石桥容器环境访问阿里云测试环境",
          "level": "普通",
          "当前处理人": "牟耀定",
          "处理时间": "2020-05-27T19:18:49",
          "工单状态": "部门经理审批",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 25,
          "title": "1248678",
          "level": "紧急",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-27T17:35:18",
          "工单状态": "新建工单",
          "问题类型": "经纬CMS",
          "工单类型": "账号申请"
        }, {
          "id": 23,
          "title": "账号申请工单",
          "level": null,
          "当前处理人": "王思博",
          "处理时间": "2020-05-27T17:22:15",
          "工单状态": "部门经理审批",
          "问题类型": "经纬CMS",
          "工单类型": "账号申请"
        }, {
          "id": 21,
          "title": "工单系统测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-05-28T11:21:07",
          "工单状态": "工程师处理中",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 20,
          "title": "测试",
          "level": "普通",
          "当前处理人": "郑强",
          "处理时间": "2020-05-28T11:02:49",
          "工单状态": "工程师处理中",
          "问题类型": "终端不可用",
          "工单类型": "报障"
        }, {
          "id": 19,
          "title": "测试",
          "level": "普通",
          "当前处理人": "郑强",
          "处理时间": "2020-05-27T17:12:55",
          "工单状态": "等待工程师处理",
          "问题类型": "终端不可用",
          "工单类型": "报障"
        }, {
          "id": 18,
          "title": "测试",
          "level": "普通",
          "当前处理人": "郑强",
          "处理时间": "2020-05-27T17:12:49",
          "工单状态": "等待工程师处理",
          "问题类型": "终端不可用",
          "工单类型": "报障"
        }, {
          "id": 17,
          "title": "工单系统测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-06-02T09:38:50",
          "工单状态": "工程师处理中",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 16,
          "title": "工单测试",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-27T17:08:14",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 14,
          "title": "工单系统测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-05-29T09:16:10",
          "工单状态": "工程师处理中",
          "问题类型": "后台异常",
          "工单类型": "报障"
        }, {
          "id": 13,
          "title": "工单系统测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-05-27T17:03:47",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 12,
          "title": "工单测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-05-27T17:02:01",
          "工单状态": "等待工程师处理",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 11,
          "title": "工单系统测试",
          "level": "普通",
          "当前处理人": "常凯隆",
          "处理时间": "2020-05-28T15:03:27",
          "工单状态": "工程师处理中",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 6,
          "title": "测试第二次紧急",
          "level": "紧急",
          "当前处理人": "牟耀定",
          "处理时间": "2020-05-27T17:48:21",
          "工单状态": "等待工程师处理",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }, {
          "id": 5,
          "title": "工单系统测试",
          "level": "普通",
          "当前处理人": "戴雨蕾",
          "处理时间": "2020-05-28T10:01:48",
          "工单状态": "等待归档",
          "问题类型": "舆情问题",
          "工单类型": "报障"
        }, {
          "id": 3,
          "title": "测试流转第三次",
          "level": "普通",
          "当前处理人": "用户不存在",
          "处理时间": "2020-05-27T15:26:56",
          "工单状态": "等待反馈",
          "问题类型": "新增",
          "工单类型": "网络安全策略"
        }],

        currPage: this.$route.params.pageFlag,
      }
    },
    mounted() {
      this.gettableInfo()
    },
    components: {
      'vue-seamless-scroll': vueSeamlessScroll
    },
    computed: {
      classOption() {
        return {
          step: 1,//数值越大速度滚动越快，更多参数参考官网参数配置
          // limitMoveNum: 2,// 开始无缝滚动的数据量
        }
      }
    },
    methods: {
      onConfirm() {
        this.$refs.item.toggle();
      },
      /**
       * @function gettableInfo 获取表格的列和源数据
       */
      gettableInfo() {
        this.$axios.get('api/bootstrapTable.do').then((res) => {
          $('#table').bootstrapTable({
            contentType: "application/x-www-form-urlencoded; charset=UTF-8",
            pagination: true,  //是否分页
            //toolbar: '#toolbar',
            detailView: true,  //前面的加号，详细数据
            singleSelect: true,
            checkbox: true,
            rowStyle: this.rowStyle,
            cellStyle: this.cellStyle,
            clickToSelect: true,
            sortable: true,    //是否排阻
            sortOrder: 'asc',  //正序或者倒序
            pageSize: 5,       //每夜显示多少条
            striped: true,     //是否斑马纹
            search: true,      //显示搜索
            searchText: '',    //搜索默认文字
            strictSearch: false, //是否模糊搜索
            showRefresh: true,   //显示刷新
            showToggle: true,    //显示表格别的样式
            showPaginationSwitch: true, //显示分页功能
            showFullscreen: true,   //是否全屏
            minimumCountColumns: 5,  //最少几条不显示分页
            paginationPreText: '上一页',  //上一页
            paginationNextText: '下一页', //下一页
            pageList: [5, 10, 15],  //可供选择的每叶条数
            data: res.data.data.tabelList,  //表格数据
            columns: res.data.data.columns  //表格列数据
          })
        }).catch((error) => {
          console.error(error)
        })

      },
      /**
       * @function rowStyle
       * @param row
       * @param index
       * @returns {{css: {background: string}}|{}}
       */
      rowStyle(row, index) {
        console.info(row, index)
        if (index % 2 === 0) {
          return {
            css: {
              'background': '#58aef7'
            }
          }
        } else {
          return {}
        }
      },
      /**
       * @function cellStyle
       * @param row
       * @param index
       * @returns {{css: {background: string}}|{}}
       */
      cellStyle(row, index) {
        if (index % 2 === 0) {
          return {
            css: {
              'background': '#58aef7'
            }
          }
        } else {
          return {}
        }
      }
    },

  }
</script>

<style scoped>
  .inner-container {
    animation: myMove 5s linear infinite;
    animation-fill-mode: forwards;
  }

  /*文字无缝滚动*/
  @keyframes myMove {
    0% {
      transform: translateY(0);
    }
    100% {
      transform: translateY(-150px);
    }
  }

  .seamless-warp {
    width: 100%;
    height: 200px;
    overflow: hidden;
  }
</style>
